var app = app || {};
app.config = app.config || {};
app.config.hoverInfo = {
	line:{
		'ma':'均線',
		'ema':'指數均線',
		'macd':'指數差離指標',
		'bbi':'多空指標<br>(均線棒數, 前項倍數, 指數均線棒數, 前項倍數)',
		'kd':'隨機指標',
		'Chaikin':'蔡金指標<br>(派發線棒數, 派發線棒數, 均量棒數)',
		'eom':'簡易波動指標',
		'yu-car':'方向盤指標<br>(現在線數的幾日K數, 轉速, 回轉係數)',
		'yu-clock':'背離線',
		'yu-macd':'余氏線',
		'osc':'振盪量指標',
		'rsi':'相對強弱指標',
		'sar':'拋物線指標',
		'dmi':'趨勢指標',
		'atr':'真實波幅',
		'AccDist': [
			'累積/派發線',
			'Accumulation/Distribution Line 累積/派發線是一個考慮到價格和成交量的動能指標(momentum indicator)。',
			'成交量指標背後的信念是成交量變化先於價格。',
			'很多時候，在股價開始上升前成交量都會在之前大增。大部分資金流向指標的目的是想在股價變動前及早發現流入或流出的成交量增加。',
			'累積/派發線向上代表資金流入股票，存在股價繼續向上的動力。',
			'累積/派發線向下代表資金流出股票，存在股價繼續向下的動力。',
			'當股價走勢和累積/派發線出現背馳時，表示價格走勢有機會改變方向。',
		].join('<br>')
	}
}