var app = app || {};
app.config = app.config || {};
app.config.hoverInfo = {
	line:{
		'ma':'均線',
		'ema':'指數均線',
		'macd':'指數差離指標',
		'bbi':'多空指標<br>(均線棒數, 前項倍數, 指數均線棒數, 前項倍數)',
		'kd':'隨機指標',
		'Chaikin': [
			'<div style="width: 600px"><h2>蔡金指標(派發線棒數, 派發線棒數, 均量棒數)</h2>',
			'累積/派發線的指數差離曲線',
			'蔡金指標與股價產生背離時，可視為反轉訊號。',
			'蔡金指標本身俱有超買超賣的作用，但是，其超買和超賣的界限位置，隨著個股不同而不同。 股民須自行認定。',
			'蔡金指標由負值向上穿越0軸時，為買進訊號。',
			'蔡金指標由正值向下穿越0軸時，為賣出訊號。',
			'</div>'
		].join('<br>'),
		
		'eom':[
			'<div style="width: 600px"><h2>簡易波動指標（又稱EMV）</h2>',
			'EMV下降：買氣不斷的萎靡退縮，致使成交量逐漸的減少',
			'EMV轉而向上、突破零：股價下跌至某一個合理支撐區，撿便宜貨的買單促使成交量再度活躍（買進訊號）',
			'EMV提前轉下、跌破零：市場人氣聚集越來越多，直到出現大交易量（賣出訊號）',
			'EMV理論精髓：無法接受股價在漲升的過程，不斷的出現高成交量消耗力氣，反而認同徐緩成交的上漲，能夠保存一定的元氣，促使漲勢能走得更遠更長',
			'</div>'
		].join('<br>'),
			
		'yu-car':'方向盤指標<br>(現在線數的幾日K數, 轉速, 回轉係數)',
		'yu-clock':'背離線',
		'yu-macd':'余氏線',
		
		'osc': [
			'<div style="width: 600px"><h2>振盪量指標</h2>',
			'動量指標MTM的另一種表現型式',
			'其使用恆速原則－每個區間的漲跌幅應該相等。想像正在向上爬的雲霄飛車，其將要攻頂後滑下來',
			'注意其背離訊號',
			'飛車下滑後往上爬：買進訊號',
			'飛車上爬後往下滑：賣出訊號',
			'</div>'
		].join('<br>'),
		
		'rsi':'相對強弱指標',
		'sar':'拋物線指標',
		'dmi':'趨勢指標',
		'atr':'真實波幅',
		'AccDist': [
			'<div style="width: 600px"><h2>累積/派發線</h2>',
			'Accumulation/Distribution Line 累積/派發線是一個考慮到價格和成交量的動能指標(momentum indicator)。',
			'成交量指標背後的信念是成交量變化先於價格。',
			'很多時候，在股價開始上升前成交量都會在之前大增。大部分資金流向指標的目的是想在股價變動前及早發現流入或流出的成交量增加。',
			'累積/派發線向上代表資金流入股票，存在股價繼續向上的動力。',
			'累積/派發線向下代表資金流出股票，存在股價繼續向下的動力。',
			'當股價走勢和累積/派發線出現背馳時，表示價格走勢有機會改變方向。',
			'</div>'
		].join('<br>'),
		
		'yu-kd':'<h2>kd圖表線</h2>'
	}
}

